Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.0.29/atdf/PIC32MZ2048EFH124.atdf
         <module id="02787" name="CFG" version="">
            <instance name="CFG">
               <register-group address-space="periph_pb1_std" name="CFG" name-in-module="CFG" offset="0x1f800000"/>
               <parameters>
                  <param name=""/>
               </parameters>
            </instance>
         </module>
         <module id="00866" name="CMP" version="">
            <instance name="CMP">
               <register-group address-space="periph_pb3_std" name="CMP" name-in-module="CMP" offset="0x1f84c000"/>
               <parameters>
                  <param name=""/>
               </parameters>
            </instance>
         </module>
         <module id="00000" name="CORE" version="">
            <instance name="CORE">
               <register-group address-space="" name="CORE" name-in-module="CORE" offset="0x0"/>
               <parameters>
                  <param name=""/>
               </parameters>
            </instance>
         </module>
         <module id="02823" name="CRU" version="">
            <instance name="CRU">
               <register-group address-space="periph_pb1_std" name="CRU" name-in-module="CRU" offset="0x1f801200"/>
               <parameters>
                  <param name=""/>
               </parameters>
            </instance>
         </module>
         <module id="00800" name="CVR" version="">
            <instance name="CVR">
               <register-group address-space="periph_pb1_std" name="CVR" name-in-module="CVR" offset="0x1f800e00"/>
               <parameters>
                  <param name=""/>
               </parameters>
            </instance>
         </module>
         <module id="01500" name="DMAC" version="">
            <instance name="DMAC">
               <register-group address-space="periph_pb1_fast" name="DMAC" name-in-module="DMAC" offset="0x1f811000"/>
               <parameters>
                  <param name=""/>
               </parameters>
            </instance>
         </module>
         <module id="01520" name="DMT" version="">
            <instance name="DMT">
               <register-group address-space="periph_pb1_std" name="DMT" name-in-module="DMT" offset="0x1f800a00"/>
               <parameters>
                  <param name=""/>
               </parameters>
            </instance>
         </module>
         <module id="00109" name="EBI" version="">
            <instance name="EBI">
               <register-group address-space="periph_indep" name="EBI" name-in-module="EBI" offset="0x1f8e1014"/>
               <parameters>
                  <param name=""/>
               </parameters>
            </instance>
         </module>
         <module id="01114" name="ETH" version="">
            <instance name="ETH">
               <register-group address-space="periph_pb5_std" name="ETH" name-in-module="ETH" offset="0x1f882000"/>
               <parameters>
                  <param name=""/>
               </parameters>
            </instance>
         </module>
         <module id="02467" name="GPIO" version="">
            <instance name="GPIO">
               <register-group address-space="periph_pb4_std" name="GPIO" name-in-module="GPIO" offset="0x1f860000"/>
               <parameters>
                  <param name=""/>
               </parameters>
            </instance>
         </module>
         <module id="01441" name="I2C" version="">
            <instance name="I2C1">
               <register-group address-space="periph_pb2_std" name="I2C" name-in-module="I2C" offset="0x1f820000"/>
               <parameters>
                  <param name=""/>
               </parameters>
            </instance>
            <instance name="I2C2"/>
            <instance name="I2C3"/>
            <instance name="I2C4"/>
            <instance name="I2C5"/>
         </module>
         <module id="00740" name="ICAP" version="">
            <instance name="ICAP1">
               <parameters>
                  <param name="TMR_SRC_0" value="0" caption="Timer 3"/>
                  <param name="TMR_SRC_1" value="1" caption="Timer 2"/>
                  <param name="TMR_ALTERNATE_SRC_0" value="0" caption="Timer 5"/>
                  <param name="TMR_ALTERNATE_SRC_1" value="1" caption="Timer 4"/>
               </parameters>
			      </instance>
            <instance name="ICAP2">
               <parameters>
                   <param name="TMR_SRC_0" value="0" caption="Timer 3"/>
                   <param name="TMR_SRC_1" value="1" caption="Timer 2"/>
                   <param name="TMR_ALTERNATE_SRC_0" value="0" caption="Timer 5"/>
                   <param name="TMR_ALTERNATE_SRC_1" value="1" caption="Timer 4"/>
               </parameters>
			      </instance>
            <instance name="ICAP3">
               <parameters>
                   <param name="TMR_SRC_0" value="0" caption="Timer 3"/>
                   <param name="TMR_SRC_1" value="1" caption="Timer 2"/>
                   <param name="TMR_ALTERNATE_SRC_0" value="0" caption="Timer 5"/>
                   <param name="TMR_ALTERNATE_SRC_1" value="1" caption="Timer 4"/>
               </parameters>
			      </instance>
            <instance name="ICAP4">
               <parameters>
                   <param name="TMR_SRC_0" value="0" caption="Timer 3"/>
                   <param name="TMR_SRC_1" value="1" caption="Timer 2"/>
                   <param name="TMR_ALTERNATE_SRC_0" value="0" caption="Timer 3"/>
                   <param name="TMR_ALTERNATE_SRC_1" value="1" caption="Timer 2"/>
               </parameters>
			      </instance>
            <instance name="ICAP5">
               <parameters>
                   <param name="TMR_SRC_0" value="0" caption="Timer 3"/>
                   <param name="TMR_SRC_1" value="1" caption="Timer 2"/>
                   <param name="TMR_ALTERNATE_SRC_0" value="0" caption="Timer 3"/>
                   <param name="TMR_ALTERNATE_SRC_1" value="1" caption="Timer 2"/>
               </parameters>
			      </instance>
