Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.0.29/atdf/PIC32MZ2048EFH124.atdf
      <value-group caption="Digital Comparator x Analog Input Identification bits" name="ADCCMPCON6__AINID">
         <value caption="AN31 is being monitored" name="" value="0x1f"/>
         <value caption="AN30 is being monitored" name="" value="0x1e"/>
         <value caption="AN1 is being monitored" name="" value="0x1"/>
         <value caption="AN0 is being monitored" name="" value="0x0"/>
      </value-group>
      <value-group caption="ADCx Identifier bits" name="ADCFSTAT__ADCID">
         <value caption="Reserved" name="" value="0x7"/>
         <value caption="Reserved" name="" value="0x6"/>
         <value caption="Reserved" name="" value="0x5"/>
         <value caption="Converted data of ADC4 is stored in FIFO" name="" value="0x4"/>
         <value caption="Converted data of ADC0 is stored in FIFO" name="" value="0x0"/>
      </value-group>
      <value-group caption="FIFO Write Overflow Error Status bit" name="ADCFSTAT__FWROVERR">
         <value caption="A write overflow error in the FIFO has occurred (circular FIFO)" name="" value="0x1"/>
         <value caption="A write overflow error in the FIFO has not occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="FIFO Data Ready Interrupt Status bit" name="ADCFSTAT__FRDY">
         <value caption="FIFO has data to be read" name="" value="0x1"/>
         <value caption="No data is available in the FIFO" name="" value="0x0"/>
      </value-group>
      <value-group caption="FIFO Interrupt Enable bit" name="ADCFSTAT__FIEN">
         <value caption="FIFO interrupts are enabled; an interrupt is generated once the FRDY bit is set" name="" value="0x1"/>
         <value caption="FIFO interrupts are disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="ADC0 Enable bit" name="ADCFSTAT__ADC0EN">
         <value caption="Converted output data of ADC is stored in the FIFO" name="" value="0x1"/>
         <value caption="Converted output data of ADC is not stored in the FIFO" name="" value="0x0"/>
      </value-group>
      <value-group caption="ADC1 Enable bit" name="ADCFSTAT__ADC1EN">
         <value caption="Converted output data of ADC is stored in the FIFO" name="" value="0x1"/>
         <value caption="Converted output data of ADC is not stored in the FIFO" name="" value="0x0"/>
      </value-group>
      <value-group caption="ADC2 Enable bit" name="ADCFSTAT__ADC2EN">
         <value caption="Converted output data of ADC is stored in the FIFO" name="" value="0x1"/>
         <value caption="Converted output data of ADC is not stored in the FIFO" name="" value="0x0"/>
      </value-group>
      <value-group caption="ADC3 Enable bit" name="ADCFSTAT__ADC3EN">
         <value caption="Converted output data of ADC is stored in the FIFO" name="" value="0x1"/>
         <value caption="Converted output data of ADC is not stored in the FIFO" name="" value="0x0"/>
      </value-group>
      <value-group caption="ADC4 Enable bit" name="ADCFSTAT__ADC4EN">
         <value caption="Converted output data of ADC is stored in the FIFO" name="" value="0x1"/>
         <value caption="Converted output data of ADC is not stored in the FIFO" name="" value="0x0"/>
      </value-group>
      <value-group caption="FIFO Enable bit" name="ADCFSTAT__FEN">
         <value caption="FIFO is enabled" name="" value="0x1"/>
         <value caption="FIFO is disabled; no data is being saved into the FIFO" name="" value="0x0"/>
      </value-group>
      <value-group caption="Trigger Level and Edge Sensitivity bit 0" name="ADCTRGSNS__LVL0">
         <value caption="Analog input is sensitive to the high level of its trigger (level sensitivity implies retriggering as long as the trigger signal remains high)" name="" value="0x1"/>
         <value caption="Analog input is sensitive to the positive edge of its trigger (this is the value after a reset)" name="" value="0x0"/>
      </value-group>
      <value-group caption="Trigger Level and Edge Sensitivity bit 1" name="ADCTRGSNS__LVL1">
         <value caption="Analog input is sensitive to the high level of its trigger (level sensitivity implies retriggering as long as the trigger signal remains high)" name="" value="0x1"/>
         <value caption="Analog input is sensitive to the positive edge of its trigger (this is the value after a reset)" name="" value="0x0"/>
      </value-group>
      <value-group caption="Trigger Level and Edge Sensitivity bit 2" name="ADCTRGSNS__LVL2">
         <value caption="Analog input is sensitive to the high level of its trigger (level sensitivity implies retriggering as long as the trigger signal remains high)" name="" value="0x1"/>
         <value caption="Analog input is sensitive to the positive edge of its trigger (this is the value after a reset)" name="" value="0x0"/>
      </value-group>
      <value-group caption="Trigger Level and Edge Sensitivity bit 3" name="ADCTRGSNS__LVL3">
         <value caption="Analog input is sensitive to the high level of its trigger (level sensitivity implies retriggering as long as the trigger signal remains high)" name="" value="0x1"/>
         <value caption="Analog input is sensitive to the positive edge of its trigger (this is the value after a reset)" name="" value="0x0"/>
      </value-group>
      <value-group caption="Trigger Level and Edge Sensitivity bit 4" name="ADCTRGSNS__LVL4">
         <value caption="Analog input is sensitive to the high level of its trigger (level sensitivity implies retriggering as long as the trigger signal remains high)" name="" value="0x1"/>
         <value caption="Analog input is sensitive to the positive edge of its trigger (this is the value after a reset)" name="" value="0x0"/>
      </value-group>
      <value-group caption="Trigger Level and Edge Sensitivity bit 5" name="ADCTRGSNS__LVL5">
         <value caption="Analog input is sensitive to the high level of its trigger (level sensitivity implies retriggering as long as the trigger signal remains high)" name="" value="0x1"/>
         <value caption="Analog input is sensitive to the positive edge of its trigger (this is the value after a reset)" name="" value="0x0"/>
      </value-group>
      <value-group caption="Trigger Level and Edge Sensitivity bit 6" name="ADCTRGSNS__LVL6">
         <value caption="Analog input is sensitive to the high level of its trigger (level sensitivity implies retriggering as long as the trigger signal remains high)" name="" value="0x1"/>
         <value caption="Analog input is sensitive to the positive edge of its trigger (this is the value after a reset)" name="" value="0x0"/>
      </value-group>
      <value-group caption="Trigger Level and Edge Sensitivity bit 7" name="ADCTRGSNS__LVL7">
         <value caption="Analog input is sensitive to the high level of its trigger (level sensitivity implies retriggering as long as the trigger signal remains high)" name="" value="0x1"/>
         <value caption="Analog input is sensitive to the positive edge of its trigger (this is the value after a reset)" name="" value="0x0"/>
      </value-group>
